kbreddiee/octokey/firmware/hub-tdeck/sdkconfig.defaults
# espkvm hub-tdeck — LILYGO T-Deck / T-Deck Plus (ESP32-S3).
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

# Latency over size
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# HKDF for pairing key derivation (off by default in IDF)
CONFIG_MBEDTLS_HKDF_C=y

# ESP-NOW supports at most 6-7 encrypted peers by default; we need 10
# dongles + the broadcast pseudo-peer.
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=14

# Room for the embedded web app + a few JSON messages in flight
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_WS_SUPPORT=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
